; domain
;Header and description

(define (domain at_work_domain)

;remove requirements that are not needed
(:requirements :strips  :typing )

(:types 
    object
    concept
    robot
    plane
    cube - object
    location
    hole - concept
    sq_hole - hole
    rnd_hole - hole 
    station - plane
)

; un-comment following line if constants are needed
;(:constants )

(:predicates 
    (robot_at ?bot - robot ?loc - location)
    (hole_in ?hol - hole ?st - plane)
    (plane_at ?st - plane ?at - location)

    (on ?obj - object ?st - station)
    (in ?obj - object ?hol - hole)

    (holding ?bot - robot ?obj - object)
    (empty_gripper ?bot - robot)

    (is_next_to ?loc1 - location ?loc2 - location)
)


;(:functions ;todo: define numeric functions here
;)

(:action move_base
    :parameters (?bot - robot ?from ?to - location)
    :precondition (and 
        (robot_at ?bot ?from) 
        (or(is_next_to ?from ?to) (is_next_to ?to ?from) )
    )
    :effect (and 
        (not(robot_at ?bot ?from))
            (robot_at ?bot ?to) 
    )
)

(:action plane_pick_up
    :parameters (?bot - robot ?obj - object ?from - plane ?at - location)
    :precondition (and
                    (robot_at ?bot ?at)
                    (plane_at ?from ?at)
                    (on ?obj ?from)
                    (empty_gripper ?bot)
    )
    :effect (and (not(on ?obj ?from))
                (not(empty_gripper ?bot))
                (holding ?bot ?obj)
    )
)

(:action hole_pick_up
    :parameters (?bot - robot ?obj - object ?from - hole ?in - plane ?at - location)
    :precondition (and
                    (robot_at ?bot ?at)
                    (hole_in ?from ?in)
                    (in ?obj ?from)
                    (empty_gripper ?bot)
    )
    :effect (and (not(in ?obj ?from))
                (not(empty_gripper ?bot))
                (holding ?bot ?obj)
    )
)
(:action place_on
    :parameters (?bot - robot ?obj - object ?on - plane ?at - location)
    :precondition (and
                    (robot_at ?bot ?at)
                    (plane_at ?on ?at)
                    (holding ?bot ?obj)
    )
    :effect (and (on ?obj ?on)
                (empty_gripper ?bot)
                (not(holding ?bot ?obj))
    )
)
(:action place_in
    :parameters (?bot - robot ?obj - object ?in - hole ?st - plane ?at - location)
    :precondition (and
                    (robot_at ?bot ?at)
                    (plane_at ?st ?at)
                    (hole_in ?in ?st)
                    (holding ?bot ?obj)
    )
    :effect (and (in ?obj ?in)
                (empty_gripper ?bot)
                (not(holding ?bot ?obj))
    )
)
)

; problem
(define (problem task1) (:domain at_work_domain)
(:objects 

n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 - location
s1 s2 s3 s4 s5 s6 - station
red_bot - robot 
c1 c2 - cube
hole1 - sq_hole
)

(:init
    (is_next_to n0 n10)
    (is_next_to n0 n5)
    
    (is_next_to n1 n4)

    (is_next_to n1 n2)
    (is_next_to n2 n3)
    (is_next_to n3 n4)
    (is_next_to n4 n5)

    (is_next_to n5 n6)
    (is_next_to n5 n0)
    (is_next_to n5 n10)

    (is_next_to n6 n7)
    (is_next_to n7 n8)
    (is_next_to n8 n9)
    (is_next_to n9 n10)
    
    (plane_at s1 n1)
    (plane_at s2 n2)
    (plane_at s3 n3)
    (plane_at s4 n7)
    (plane_at s5 n8)
    (plane_at s6 n9)

    (robot_at red_bot n0)
    (empty_gripper red_bot)

    (on c1 s6)
    (on c2 s4)

    (hole_in hole1 s3)

)

(:goal (and
    (on c1 s5)
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (move_base red_bot n0 n10)
   deleted: (robot_at red_bot n0)
   added: (robot_at red_bot n10)
   goals met: 0 of 1
2. (move_base red_bot n10 n9)
   deleted: (robot_at red_bot n10)
   added: (robot_at red_bot n9)
   goals met: 0 of 1
3. (plane_pick_up red_bot c1 s6 n9)
   deleted: (on c1 s6) (empty_gripper red_bot)
   added: (holding red_bot c1)
   goals met: 0 of 1
4. (move_base red_bot n9 n8)
   deleted: (robot_at red_bot n9)
   added: (robot_at red_bot n8)
   goals met: 0 of 1
5. (place_on red_bot c1 s5 n8)
   deleted: (holding red_bot c1)
   added: (on c1 s5) (empty_gripper red_bot)
   goals met: 1 of 1
